Tekla.Structures.DirectManipulation.Adapter.Interaction.AutoSaveHandler
The Tekla.Structures.DirectManipulation.Adapter.Interaction.AutoSaveHandler class handle the auto-save of TS models based on the handle manipulation.

Tekla.Structures.DirectManipulation.Adapter.Interaction.AutoSaveHandler.lastModifiedObjectId
The ID of the last modified object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.AutoSaveHandler.CheckAutoSaveState(System.Int32)
Checks the auto-save state (increase the command count and trigger auto-save if needed).
modifiedObjectId: The ID of the modified object.
Returns: True if the auto-save state is updated; otherwise, false.